Tekla.Structures.Model.UI.View.ViewRenderingType
The view rendering types.
Only rendered views can be modified.

Tekla.Structures.Model.UI.View.ViewRenderingType.WIREFRAME_VIEW
The wireframe view type.

Tekla.Structures.Model.UI.View.ViewRenderingType.RENDERED_VIEW
The rendered view type.